In [19]:
import pandas as pd

data = {
    "Name" : ["홍길동","임꺽정", "성춘향"],
    "Age" : [25,None,20],
    "City" : ["서울","부산",None]
}

df = pd.DataFrame(data)
# df
# df.isnull()
# df.isnull().sum()
# df.dropna()
# df.info()
# df_drop_column = df.dropna(axis=1) # 행 삭제
# df_drop_column
# df_fill_f = df.fillna(method="ffill") # 이전 값으로 채우기
df_fill_b = df.fillna(method="bfill") # 다음 값으로 채우기
df_fill_b

C:\Users\wiewk\AppData\Local\Temp\ipykernel_11124\4034729781.py:18: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_fill_b = df.fillna(method="bfill") # 다음 값으로 채우기

  Name   Age  City
0  홍길동  25.0    서울
1  임꺽정  20.0    부산
2  성춘향  20.0  None

In [ ]:
# isin() 메서드
s = pd.Series(["홍길동","임꺽정","성춘향","이몽룡"])
result = s.isin(["홍길동","이몽룡"])
result

0     True
1    False
2    False
3     True
dtype: bool

In [22]:
data={
    "Name" : ["홍길동","임꺽정","성춘향","이몽룡"],
    "Age" : [25,30,20,32]
}
df = pd.DataFrame(data)

result = df.isin(["성춘향","홍길동"])
result

    Name    Age
0   True  False
1  False  False
2   True  False
3  False  False

In [ ]:
s = pd.Series([1,2,None])
result = s.isin([None,2]) # 결측값 무시
result

0    False
1     True
2    False
dtype: bool

In [35]:
data={
    "Name" : ["홍길동","임꺽정","성춘향","이몽룡"],
    "Age" : [25,30,20,32]
}
df = pd.DataFrame(data)
result = df['Name'].isin(["성춘향","홍길동","이몽룡"])
result

0     True
1    False
2     True
3     True
Name: Name, dtype: bool

In [24]:
s = pd.Series(["사과", "바나나","사과","오렌지","바나나","사과"])
s.value_counts()

사과     3
바나나    2
오렌지    1
Name: count, dtype: int64

In [ ]:
df = pd.DataFrame({
    "과일" : ['사과','바나나','사과', '오렌지','바나나','사과'],
    '수량' : [1,2,3,4,5,6]

})
#df['과일'].value_counts(normalize=True) # 빈도르 비율(%)
#df['과일'].value_counts(ascending=True) # 오름차순
df['과일'].value_counts(dro)

과일
사과     3
바나나    2
오렌지    1
Name: count, dtype: int64

In [36]:
s = pd.Series([1,2,3,4,5])
result = s.agg(['sum','mean','max'])
result

sum     15.0
mean     3.0
max      5.0
dtype: float64

In [38]:
df = pd.DataFrame({
    'A':[1,2,3],
    'B':[10,11,12]
})
df.agg({'A':'sum','B' : 'mean'})

A     6.0
B    11.0
dtype: float64

In [50]:
s1 = pd.Series([10,20,30])
s2 = pd.Series([5,15,25])

# s1 + s2
# s1 - s2
# s1 * s2
# s1 / s2

# 통계 연산

s1.sum()
s1.mean() # 평균
s1.max()
s1.min()
s1.std() # 표준편차
s1.var() # 분산
s1.median() # 중앙값
# 통계 지표
s1.describe()

count     3.0
mean     20.0
std      10.0
min      10.0
25%      15.0
50%      20.0
75%      25.0
max      30.0
dtype: float64

In [ ]:
data = {
    'group' : ['A','A','B','B','C'],
    'value1' : [10,20,30,40,50],
    'value2' : [5, 15, 25, 35, 45]
}
df = pd.DataFrame(data)

# result =df.groupby('group')['value'].mean()
# result =df.groupby('group')['value'].agg(['sum','mean','max'])
# result = df.groupby('group').agg({
#     'value1' : 'sum',
#     'value2' :['mean','max']
# })
# result = df.groupby('group').filter(lambda x : x['value1'].sum() > 30)


result

  group  value1  value2
2     B      30      25
3     B      40      35
4     C      50      45